espressif/esp-idf/components/soc/esp32c61/include/soc/spi_struct.h
/**
 * SPDX-FileCopyrightText: 2024 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: User-defined control registers */
/** Type of cmd register
 *  Command control register
 */
typedef union {
    struct {
        /** conf_bitlen : R/W; bitpos: [17:0]; default: 0;
         *  Configures the SPI_CLK cycles of SPI CONF state.
         *  Measurement unit: SPI_CLK clock cycle.\\
         *  Can be configured in CONF state.
         */
        uint32_t conf_bitlen:18;
        uint32_t reserved_18:5;
        /** update : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to synchronize SPI registers from APB clock domain into
         *  SPI module clock domain. \\
         *  0: Not synchronize \\
         *  1: Synchronize \\
         *  This bit is only used in SPI master transfer.
         */
        uint32_t update:1;
        /** usr : R/W/SC; bitpos: [24]; default: 0;
         *  Configures whether or not to enable user-defined command. \\
         *  0: Not enable \\
         *  1: Enable \\
         *  An SPI operation will be triggered when the bit is set. This bit will be cleared
         *  once the operation is done. Can not be changed by CONF_buf.
         */
        uint32_t usr:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} spi_cmd_reg_t;

/** Type of addr register
 *  Address value register
 */
typedef union {
    struct {
        /** usr_addr_value : R/W; bitpos: [31:0]; default: 0;
         *  Configures the address to slave.
         *  Can be configured in CONF state.
         */
        uint32_t usr_addr_value:32;
    };
    uint32_t val;
} spi_addr_reg_t;

/** Type of user register
 *  SPI USER control register
 */
typedef union {
    struct {
        /** doutdin : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable full-duplex communication. \\
         *  0: Disable \\
         *  1: Enable \\
         *  Can be configured in CONF state.
         */
        uint32_t doutdin:1;
        uint32_t reserved_1:2;
        /** qpi_mode : R/W/SS/SC; bitpos: [3]; default: 0;
         *  Configures whether or not to enable QPI mode. \\
         *  0: Disable \\
         *  1: Enable \\
         *  This configuration is applicable when the SPI controller works as master or slave.
         *  Can be configured in CONF state.
         */
        uint32_t qpi_mode:1;
        /** opi_mode : HRO; bitpos: [4]; default: 0;
         *  Just for master mode. 1: spi controller is in OPI mode (all in 8-b-m). 0: others.
         *  Can be configured in CONF state.
         */
        uint32_t opi_mode:1;
        /** tsck_i_edge : R/W; bitpos: [5]; default: 0;
         *  Configures whether or not to change the polarity of TSCK in slave transfer. \\
         *  0: TSCK = SPI_CK_I \\
         *  1: TSCK = !SPI_CK_I \\
         */
        uint32_t tsck_i_edge:1;
        /** cs_hold : R/W; bitpos: [6]; default: 1;
         *  Configures whether or not to keep SPI CS low when SPI is in DONE state. \\
         *  0: Not keep low \\
         *  1: Keep low \\
         *  Can be configured in CONF state.
         */
        uint32_t cs_hold:1;
        /** cs_setup : R/W; bitpos: [7]; default: 1;
         *  Configures whether or not to enable SPI CS when SPI is in prepare (PREP) state. \\
         *  0: Disable \\
         *  1: Enable \\
         *  Can be configured in CONF state.
         */
        uint32_t cs_setup:1;
        /** rsck_i_edge : R/W; bitpos: [8]; default: 0;
         *  Configures whether or not to change the polarity of RSCK in slave transfer. \\
         *  0: RSCK = !SPI_CK_I \\
         *  1: RSCK = SPI_CK_I \\
         */
        uint32_t rsck_i_edge:1;
        /** ck_out_edge : R/W; bitpos: [9]; default: 0;
         *  Configures SPI clock mode together with SPI_CK_IDLE_EDGE.
         *  Can be configured in CONF state. For more information, see Section <a href="GP-SPI2
         *  master clock control">link</a>.
         */
        uint32_t ck_out_edge:1;
        uint32_t reserved_10:2;
        /** fwrite_dual : R/W; bitpos: [12]; default: 0;
         *  Configures whether or not to enable the 2-bit mode of read-data phase in write
         *  operations.\\
         *  0: Not enable \\
         *  1: Enable \\
         *  Can be configured in CONF state.
         */
        uint32_t fwrite_dual:1;
        /** fwrite_quad : R/W; bitpos: [13]; default: 0;
         *  Configures whether or not to enable the 4-bit mode of read-data phase in write
         *  operations. \\
         *  0: Not enable \\
         *  1: Enable \\
         *  Can be configured in CONF state.
         */
        uint32_t fwrite_quad:1;
        /** fwrite_oct : HRO; bitpos: [14]; default: 0;
         *  In the write operations read-data phase apply 8 signals. Can be configured in CONF
         *  state.
         */
        uint32_t fwrite_oct:1;
        /** usr_conf_nxt : R/W; bitpos: [15]; default: 0;
         *  Configures whether or not to enable the CONF state for the next transaction
         *  (segment) in a configurable segmented transfer. \\
         *  0: this transfer will end after the current transaction (segment) is finished. Or
         *  this is not a configurable segmented transfer. \\
         *  1: this configurable segmented transfer will continue its next transaction
         *  (segment). \\
         *  Can be configured in CONF state.
         */
        uint32_t usr_conf_nxt:1;
        uint32_t reserved_16:1;
        /** sio : R/W; bitpos: [17]; default: 0;
         *  Configures whether or not to enable 3-line half-duplex communication, where MOSI
         *  and MISO signals share the same pin.\\
         *  0: Disable \\
         *  1: Enable \\
         *  Can be configured in CONF state.
         */
        uint32_t sio:1;
        uint32_t reserved_18:6;
        /** usr_miso_highpart : R/W; bitpos: [24]; default: 0;
         *  Configures whether or not to enable high part mode, i.e., only access to high part
         *  of the buffers: SPI_W8_REG ~ SPI_W15_REG in read-data phase. \\
         *  0: Disable \\
         *  1: Enable \\
         *  Can be configured in CONF state.
         */
        uint32_t usr_miso_highpart:1;
        /** usr_mosi_highpart : R/W; bitpos: [25]; default: 0;
         *  Configures whether or not to enable high part mode, i.e., only access to high part
         *  of the buffers: SPI_W8_REG ~ SPI_W15_REG in write-data phase. \\
         *  0: Disable \\
         *  1: Enable \\
         *  Can be configured in CONF state.
         */
        uint32_t usr_mosi_highpart:1;
        /** usr_dummy_idle : R/W; bitpos: [26]; default: 0;
         *  Configures whether or not to disable SPI clock in DUMMY state. \\
         *  0: Not disable \\
         *  1: Disable \\
         *  Can be configured in CONF state.
         */
        uint32_t usr_dummy_idle:1;
        /** usr_mosi : R/W; bitpos: [27]; default: 0;
         *  Configures whether or not to enable the write-data (DOUT) state of an operation. \\
         *  0: Disable \\
         *  1: Enable \\
         *  Can be configured in CONF state.
         */
        uint32_t usr_mosi:1;
        /** usr_miso : R/W; bitpos: [28]; default: 0;
         *  Configures whether or not to enable the read-data (DIN) state of an operation. \\
         *  0: Disable \\
         *  1: Enable \\
         *  Can be configured in CONF state.
         */
        uint32_t usr_miso:1;
        /** usr_dummy : R/W; bitpos: [29]; default: 0;
         *  Configures whether or not to enable the DUMMY state of an operation. \\
         *  0: Disable \\
         *  1: Enable \\
         *  Can be configured in CONF state.
         */
        uint32_t usr_dummy:1;
        /** usr_addr : R/W; bitpos: [30]; default: 0;
         *  Configures whether or not to enable the address (ADDR) state of an operation. \\
         *  0: Disable \\
         *  1: Enable \\
         *  Can be configured in CONF state.
         */
        uint32_t usr_addr:1;
        /** usr_command : R/W; bitpos: [31]; default: 1;
         *  Configures whether or not to enable the command (CMD) state of an operation. \\
         *  0: Disable \\
         *  1: Enable \\
         *  Can be configured in CONF state.
         */
        uint32_t usr_command:1;
    };
    uint32_t val;
} spi_user_reg_t;

/** Type of user1 register
 *  SPI USER control register 1
 */
typedef union {
    struct {
        /** usr_dummy_cyclelen : R/W; bitpos: [7:0]; default: 7;
         *  Configures the length of DUMMY state.
         *  Measurement unit: SPI_CLK clock cycles.\\
         *  This value is (the expected cycle number - 1). Can be configured in CONF state.
         */
        uint32_t usr_dummy_cyclelen:8;
        uint32_t reserved_8:8;
        /** mst_wfull_err_end_en : R/W; bitpos: [16]; default: 1;
         *  Configures whether or not to end the SPI transfer when SPI RX AFIFO wfull error
         *  occurs in master full-/half-duplex transfers. \\
         *  0: Not end \\
         *  1: End \\
         */
        uint32_t mst_wfull_err_end_en:1;
        /** cs_setup_time : R/W; bitpos: [21:17]; default: 0;
         *  Configures the length of prepare (PREP) state.
         *  Measurement unit: SPI_CLK clock cycles.\\
         *  This value is equal to the expected cycles - 1. This field is used together with
         *  SPI_CS_SETUP. Can be configured in CONF state.
         */
        uint32_t cs_setup_time:5;
        /** cs_hold_time : R/W; bitpos: [26:22]; default: 1;
         *  Configures the delay cycles of CS pin.
         *  Measurement unit: SPI_CLK clock cycles. \\
         *  This field is used together with SPI_CS_HOLD. Can be configured in CONF state.
         */
        uint32_t cs_hold_time:5;
        /** usr_addr_bitlen : R/W; bitpos: [31:27]; default: 23;
         *  Configures the bit length in address state.
         *  This value is (expected bit number - 1). Can be configured in CONF state.
         */
        uint32_t usr_addr_bitlen:5;
    };
    uint32_t val;
} spi_user1_reg_t;

